"""შექმენით პროგრამა, სადაც გადმოგეცემათ სიები და თქვენ მოახდენთ ფილტრაციას. თუ პირველ და მეორე სიაში ერთი და იგივე ინდექსზე მყოფი ელემენტი იგივე იქნება, 
მთვლელს დაამატეთ 4 ქულა. თუ რომელიმე ელემენტი იქნება "" - ანუ ცარიელი სთრინგი, მთვლელი არ შეცვალოთ. ხოლო თუ გექნებათ განსხვავებული ელემენტები, 
მთვლელს გამოაკელით 1 ქულა. იმუშავეთ შემდეგ სიებზე:


test cases:
["a", "a", "b", "b"], ["a", "c", "b", "d"]) → 6
["a", "a", "c", "b"], ["a", "a", "b",  ""]) → 7
["a", "a", "b", "c"], ["a", "a", "b", "c"]) → 16
["b", "c", "b", "a"], ["",  "a", "a", "c"]) → 0 """

task1_list = ["a", "a", "b", "b"]
task2_list = ["a", "a", "c", "b"]
task3_list = ["a", "a", "b", "c"]
task4_list = ["b", "c", "b", "a"]

answers1_list = ["a", "c", "b", "d"]
answers2_list = ["a", "a", "b",  ""]
answers3_list = ["a", "a", "b", "c"]
answers4_list = ["",  "a", "a", "c"]




